OpenNuvoton/M55M1BSP/Library/StdDriver/src/uart.c
    if (uart == (UART_T *)UART0)
    {
        /* Get UART clock source selection */
        u32UartClkSrcSel = (CLK->UARTSEL0 & CLK_UARTSEL0_UART0SEL_Msk) >> CLK_UARTSEL0_UART0SEL_Pos;
        /* Get UART clock divider number */
        u32UartClkDivNum = (CLK->UARTDIV0 & CLK_UARTDIV0_UART0DIV_Msk) >> CLK_UARTDIV0_UART0DIV_Pos;

    }
    else if (uart == (UART_T *)UART1)
    {
        /* Get UART clock source selection */
        u32UartClkSrcSel = (CLK->UARTSEL0 & CLK_UARTSEL0_UART1SEL_Msk) >> CLK_UARTSEL0_UART1SEL_Pos;
        /* Get UART clock divider number */
        u32UartClkDivNum = (CLK->UARTDIV0 & CLK_UARTDIV0_UART1DIV_Msk) >> CLK_UARTDIV0_UART1DIV_Pos;
    }
    else if (uart == (UART_T *)UART2)
    {
        /* Get UART clock source selection */
        u32UartClkSrcSel = (CLK->UARTSEL0 & CLK_UARTSEL0_UART2SEL_Msk) >> CLK_UARTSEL0_UART2SEL_Pos;
        /* Get UART clock divider number */
        u32UartClkDivNum = (CLK->UARTDIV0 & CLK_UARTDIV0_UART2DIV_Msk) >> CLK_UARTDIV0_UART2DIV_Pos;
    }
    else if (uart == (UART_T *)UART3)
    {
        /* Get UART clock source selection */
        u32UartClkSrcSel = (CLK->UARTSEL0 & CLK_UARTSEL0_UART3SEL_Msk) >> CLK_UARTSEL0_UART3SEL_Pos;
        /* Get UART clock divider number */
        u32UartClkDivNum = (CLK->UARTDIV0 & CLK_UARTDIV0_UART3DIV_Msk) >> CLK_UARTDIV0_UART3DIV_Pos;
    }
    else if (uart == (UART_T *)UART4)
    {
        /* Get UART clock source selection */
        u32UartClkSrcSel = (CLK->UARTSEL0 & CLK_UARTSEL0_UART4SEL_Msk) >> CLK_UARTSEL0_UART4SEL_Pos;
        /* Get UART clock divider number */
        u32UartClkDivNum = (CLK->UARTDIV0 & CLK_UARTDIV0_UART4DIV_Msk) >> CLK_UARTDIV0_UART4DIV_Pos;
    }
    else if (uart == (UART_T *)UART5)
    {
        /* Get UART clock source selection */
        u32UartClkSrcSel = (CLK->UARTSEL0 & CLK_UARTSEL0_UART5SEL_Msk) >> CLK_UARTSEL0_UART5SEL_Pos;
        /* Get UART clock divider number */
        u32UartClkDivNum = (CLK->UARTDIV0 & CLK_UARTDIV0_UART5DIV_Msk) >> CLK_UARTDIV0_UART5DIV_Pos;
    }
    else if (uart == (UART_T *)UART6)
    {
        /* Get UART clock source selection */
        u32UartClkSrcSel = (CLK->UARTSEL0 & CLK_UARTSEL0_UART6SEL_Msk) >> CLK_UARTSEL0_UART6SEL_Pos;
        /* Get UART clock divider number */
        u32UartClkDivNum = (CLK->UARTDIV0 & CLK_UARTDIV0_UART6DIV_Msk) >> CLK_UARTDIV0_UART6DIV_Pos;
    }
    else if (uart == (UART_T *)UART7)
    {
        /* Get UART clock source selection */
        u32UartClkSrcSel = (CLK->UARTSEL0 & CLK_UARTSEL0_UART7SEL_Msk) >> CLK_UARTSEL0_UART7SEL_Pos;
        /* Get UART clock divider number */
        u32UartClkDivNum = (CLK->UARTDIV0 & CLK_UARTDIV0_UART7DIV_Msk) >> CLK_UARTDIV0_UART7DIV_Pos;
    }
    else if (uart == (UART_T *)UART8)
    {
        /* Get UART clock source selection */
        u32UartClkSrcSel = (CLK->UARTSEL1 & CLK_UARTSEL1_UART8SEL_Msk) >> CLK_UARTSEL1_UART8SEL_Pos;
        /* Get UART clock divider number */
        u32UartClkDivNum = (CLK->UARTDIV1 & CLK_UARTDIV1_UART8DIV_Msk) >> CLK_UARTDIV1_UART8DIV_Pos;
    }
    else if (uart == (UART_T *)UART9)
    {
        /* Get UART clock source selection */
        u32UartClkSrcSel = (CLK->UARTSEL1 & CLK_UARTSEL1_UART9SEL_Msk) >> CLK_UARTSEL1_UART9SEL_Pos;
        /* Get UART clock divider number */
        u32UartClkDivNum = (CLK->UARTDIV1 & CLK_UARTDIV1_UART9DIV_Msk) >> CLK_UARTDIV1_UART9DIV_Pos;
    }
    else
    {
        /* Error */
    }

    /* Get APLL0 clock frequency if UART clock source selection is APLL0 */
    if (u32UartClkSrcSel == 3UL)
    {
        u32ClkTbl[u32UartClkSrcSel] = CLK_GetAPLL0ClockFreq() >> 1UL;
    }

    /* Set UART baud rate */
    if (u32baudrate != 0UL)
    {
        uint32_t u32Baud_Div;

        u32Baud_Div = UART_BAUD_MODE2_DIVIDER((u32ClkTbl[u32UartClkSrcSel]) / (u32UartClkDivNum + 1UL), u32baudrate);

        if (u32Baud_Div > 0xFFFFUL)
        {
            uart->BAUD = (UART_BAUD_MODE0 | UART_BAUD_MODE0_DIVIDER((u32ClkTbl[u32UartClkSrcSel]) / (u32UartClkDivNum + 1UL), u32baudrate));
        }
        else
        {
            uart->BAUD = (UART_BAUD_MODE2 | u32Baud_Div);
        }
    }

    /* Set UART line configuration */
    uart->LINE = u32data_width | u32parity | u32stop_bits;
}


/**
 *    @brief        Set Rx timeout count
 *
 *    @param[in]    uart    The pointer of the specified UART module.
 *    @param[in]    u32TOC  Rx timeout counter.
 *
 *    @return       None
 *
 *    @details      This function use to set Rx timeout count.
 */
void UART_SetTimeoutCnt(UART_T *uart, uint32_t u32TOC)
{
    /* Set time-out interrupt comparator */
    uart->TOUT = (uart->TOUT & ~UART_TOUT_TOIC_Msk) | (u32TOC);

    /* Set time-out counter enable */
    uart->INTEN |= UART_INTEN_TOCNTEN_Msk;
}


/**
 *    @brief        Select and configure IrDA function
 *
 *    @param[in]    uart            The pointer of the specified UART module.
 *    @param[in]    u32Buadrate     The baudrate of UART module.
 *    @param[in]    u32Direction    The direction of UART module in IrDA mode:
 *                                  - \ref UART_IRDA_TXEN
 *                                  - \ref UART_IRDA_RXEN
 *
 *    @return       None
  *
 *    @details      The function is used to configure IrDA relative settings. It consists of TX or RX mode and baudrate.
 */
void UART_SelectIrDAMode(UART_T *uart, uint32_t u32Buadrate, uint32_t u32Direction)
{
    uint32_t u32UartClkSrcSel = 0UL;
    uint32_t u32UartClkDivNum = 0UL;
    uint32_t u32ClkTbl[5] = {__HXT, __HIRC, __LXT, 0, __HIRC48M};

    /* Select IrDA function mode */
    uart->FUNCSEL = UART_FUNCSEL_IrDA;

    if (uart == (UART_T *)UART0)
    {
        /* Get UART clock source selection */
        u32UartClkSrcSel = (CLK->UARTSEL0 & CLK_UARTSEL0_UART0SEL_Msk) >> CLK_UARTSEL0_UART0SEL_Pos;
        /* Get UART clock divider number */
        u32UartClkDivNum = (CLK->UARTDIV0 & CLK_UARTDIV0_UART0DIV_Msk) >> CLK_UARTDIV0_UART0DIV_Pos;
    }
    else if (uart == (UART_T *)UART1)
    {
        /* Get UART clock source selection */
        u32UartClkSrcSel = (CLK->UARTSEL0 & CLK_UARTSEL0_UART1SEL_Msk) >> CLK_UARTSEL0_UART1SEL_Pos;
        /* Get UART clock divider number */
        u32UartClkDivNum = (CLK->UARTDIV0 & CLK_UARTDIV0_UART1DIV_Msk) >> CLK_UARTDIV0_UART1DIV_Pos;
    }
    else if (uart == (UART_T *)UART2)
    {
        /* Get UART clock source selection */
        u32UartClkSrcSel = (CLK->UARTSEL0 & CLK_UARTSEL0_UART2SEL_Msk) >> CLK_UARTSEL0_UART2SEL_Pos;
        /* Get UART clock divider number */
        u32UartClkDivNum = (CLK->UARTDIV0 & CLK_UARTDIV0_UART2DIV_Msk) >> CLK_UARTDIV0_UART2DIV_Pos;
    }
    else if (uart == (UART_T *)UART3)
    {
        /* Get UART clock source selection */
        u32UartClkSrcSel = (CLK->UARTSEL0 & CLK_UARTSEL0_UART3SEL_Msk) >> CLK_UARTSEL0_UART3SEL_Pos;
        /* Get UART clock divider number */
        u32UartClkDivNum = (CLK->UARTDIV0 & CLK_UARTDIV0_UART3DIV_Msk) >> CLK_UARTDIV0_UART3DIV_Pos;
    }
    else if (uart == (UART_T *)UART4)
    {
        /* Get UART clock source selection */
        u32UartClkSrcSel = (CLK->UARTSEL0 & CLK_UARTSEL0_UART4SEL_Msk) >> CLK_UARTSEL0_UART4SEL_Pos;
        /* Get UART clock divider number */
        u32UartClkDivNum = (CLK->UARTDIV0 & CLK_UARTDIV0_UART4DIV_Msk) >> CLK_UARTDIV0_UART4DIV_Pos;
    }
    else if (uart == (UART_T *)UART5)
    {
        /* Get UART clock source selection */
        u32UartClkSrcSel = (CLK->UARTSEL0 & CLK_UARTSEL0_UART5SEL_Msk) >> CLK_UARTSEL0_UART5SEL_Pos;
        /* Get UART clock divider number */
        u32UartClkDivNum = (CLK->UARTDIV0 & CLK_UARTDIV0_UART5DIV_Msk) >> CLK_UARTDIV0_UART5DIV_Pos;
    }
    else if (uart == (UART_T *)UART6)
    {
        /* Get UART clock source selection */
        u32UartClkSrcSel = (CLK->UARTSEL0 & CLK_UARTSEL0_UART6SEL_Msk) >> CLK_UARTSEL0_UART6SEL_Pos;
        /* Get UART clock divider number */
        u32UartClkDivNum = (CLK->UARTDIV0 & CLK_UARTDIV0_UART6DIV_Msk) >> CLK_UARTDIV0_UART6DIV_Pos;
    }
    else if (uart == (UART_T *)UART7)
    {
        /* Get UART clock source selection */
        u32UartClkSrcSel = (CLK->UARTSEL0 & CLK_UARTSEL0_UART7SEL_Msk) >> CLK_UARTSEL0_UART7SEL_Pos;
        /* Get UART clock divider number */
        u32UartClkDivNum = (CLK->UARTDIV0 & CLK_UARTDIV0_UART7DIV_Msk) >> CLK_UARTDIV0_UART7DIV_Pos;
    }
    else if (uart == (UART_T *)UART8)
    {
        /* Get UART clock source selection */
        u32UartClkSrcSel = (CLK->UARTSEL1 & CLK_UARTSEL1_UART8SEL_Msk) >> CLK_UARTSEL1_UART8SEL_Pos;
        /* Get UART clock divider number */
        u32UartClkDivNum = (CLK->UARTDIV1 & CLK_UARTDIV1_UART8DIV_Msk) >> CLK_UARTDIV1_UART8DIV_Pos;
    }
    else if (uart == (UART_T *)UART9)
    {
        /* Get UART clock source selection */
        u32UartClkSrcSel = (CLK->UARTSEL1 & CLK_UARTSEL1_UART9SEL_Msk) >> CLK_UARTSEL1_UART9SEL_Pos;
        /* Get UART clock divider number */
        u32UartClkDivNum = (CLK->UARTDIV1 & CLK_UARTDIV1_UART9DIV_Msk) >> CLK_UARTDIV1_UART9DIV_Pos;
    }
    else
    {
        /* Error */
    }

    /* Get APLL0 clock frequency if UART clock source selection is APLL0 */
    if (u32UartClkSrcSel == 3UL)
    {
        u32ClkTbl[u32UartClkSrcSel] = CLK_GetAPLL0ClockFreq() >> 1UL;
    }

    /* Set UART IrDA baud rate in mode 0 */
    if (u32Buadrate != 0UL)
    {
        uint32_t u32Baud_Div;

