OpenNuvoton/M55M1BSP/Library/StdDriver/src/uart.c
        u32Baud_Div = UART_BAUD_MODE0_DIVIDER((u32ClkTbl[u32UartClkSrcSel]) / (u32UartClkDivNum + 1UL), u32Buadrate);

        if (u32Baud_Div < 0xFFFFUL)
        {
            uart->BAUD = (UART_BAUD_MODE0 | u32Baud_Div);
        }

    }

    /* Configure IrDA relative settings */
    uart->FUNCSEL |= UART_FUNCSEL_TXRXDIS_Msk;

    while (uart->FIFOSTS & UART_FIFOSTS_TXRXACT_Msk) {};

    if (u32Direction == UART_IRDA_RXEN)
    {
        uart->IRDA |= UART_IRDA_RXINV_Msk;     /*Rx signal is inverse*/
        uart->IRDA &= ~UART_IRDA_TXEN_Msk;
    }
    else
    {
        uart->IRDA &= ~UART_IRDA_TXINV_Msk;    /*Tx signal is not inverse*/
        uart->IRDA |= UART_IRDA_TXEN_Msk;
    }

    uart->FUNCSEL &= ~UART_FUNCSEL_TXRXDIS_Msk;

}


/**
 *    @brief        Select and configure RS485 function
 *
 *    @param[in]    uart        The pointer of the specified UART module.
 *    @param[in]    u32Mode     The operation mode(NMM/AUD/AAD).
 *                              - \ref UART_ALTCTL_RS485NMM_Msk
 *                              - \ref UART_ALTCTL_RS485AUD_Msk
 *                              - \ref UART_ALTCTL_RS485AAD_Msk
 *    @param[in]    u32Addr     The RS485 address.
 *
 *    @return       None
 *
 *    @details      The function is used to set RS485 relative setting.
 */
void UART_SelectRS485Mode(UART_T *uart, uint32_t u32Mode, uint32_t u32Addr)
{
    /* Select UART RS485 function mode */
    uart->FUNCSEL = UART_FUNCSEL_RS485;

    /* Set RS485 configuration */
    uart->ALTCTL &= ~(UART_ALTCTL_RS485NMM_Msk | UART_ALTCTL_RS485AUD_Msk | UART_ALTCTL_RS485AAD_Msk | UART_ALTCTL_ADDRMV_Msk);
    uart->ALTCTL |= (u32Mode | (u32Addr << UART_ALTCTL_ADDRMV_Pos));
}


/**
 *    @brief        Select and configure LIN function
 *
 *    @param[in]    uart            The pointer of the specified UART module.
 *    @param[in]    u32Mode         The LIN direction :
 *                                  - \ref UART_ALTCTL_LINTXEN_Msk
 *                                  - \ref UART_ALTCTL_LINRXEN_Msk
 *    @param[in]    u32BreakLength  The break field length.
 *
 *    @return       None
 *
 *    @details      The function is used to set LIN relative setting.
 */
void UART_SelectLINMode(UART_T *uart, uint32_t u32Mode, uint32_t u32BreakLength)
{
    /* Select LIN function mode */
    uart->FUNCSEL = UART_FUNCSEL_LIN;

    /* Select LIN function setting : Tx enable, Rx enable and break field length */
    uart->ALTCTL &= ~(UART_ALTCTL_LINTXEN_Msk | UART_ALTCTL_LINRXEN_Msk | UART_ALTCTL_BRKFL_Msk);
    uart->ALTCTL |= (u32Mode | (u32BreakLength << UART_ALTCTL_BRKFL_Pos));
}


/**
 *    @brief        Write UART data
 *
 *    @param[in]    uart            The pointer of the specified UART module.
 *    @param[in]    pu8TxBuf        The buffer to send the data to UART transmission FIFO.
 *    @param[out]   u32WriteBytes   The byte number of data.
 *
 *    @return       u32Count transfer byte count
 *
 *    @details      The function is to write data into TX buffer to transmit data by UART.
 */
uint32_t UART_Write(UART_T *uart, const uint8_t pu8TxBuf[], uint32_t u32WriteBytes)
{
    uint32_t u32Count;
    uint32_t u32Exit = 0UL;

    for (u32Count = 0UL; u32Count != u32WriteBytes; u32Count++)
    {
        uint32_t u32delayno = 0UL;

        while (uart->FIFOSTS & UART_FIFOSTS_TXFULL_Msk)  /* Wait Tx not full or Time-out manner */
        {
            u32delayno++;

            if (u32delayno >= 0x40000000UL)
            {
                u32Exit = 1UL;
                break;
            }
        }

        if (u32Exit == 1UL)
        {
            break;
        }
        else
        {
            uart->DAT = pu8TxBuf[u32Count];    /* Send UART Data from buffer */
        }
    }

    return u32Count;
}
/**
 *    @brief        Select Single Wire mode function
 *
 *    @param[in]    uart        The pointer of the specified UART module.
 *
 *    @return       None
 *
 *    @details      The function is used to select Single Wire mode.
 */
void UART_SelectSingleWireMode(UART_T *uart)
{
    /* Select UART Single Wire function mode */
    uart->FUNCSEL = ((uart->FUNCSEL & (~UART_FUNCSEL_FUNCSEL_Msk)) | UART_FUNCSEL_SINGLE_WIRE);
}

/**
 *    @brief        Set Baud Rate Fractional Divider function
 *
 *    @param[in]    uart    The pointer of the specified UART module.
 *    @param[in]    u32BRFD Baud Rate Fractional Divider value.
 *
 *    @return       None
 *
 *    @details      This function use to set Baud Rate fractional divider value.
 */
void UART_SetBaudRateFrationalDivider(UART_T *uart, uint32_t u32BRFD)
{
    /* Enanble Baud Rate fractional divider fuction */
    /* This bit has effect only at baud rate mode 2 */
    uart->BAUD |= (UART_BAUD_BRFDEN_Msk | UART_BAUD_MODE2);
    uart->BAUD = (uart->BAUD & ~UART_BAUD_BRFD_Msk) | ((u32BRFD) << UART_BAUD_BRFD_Pos);
}
/**
 *    @brief        Disable Baud Rate Fractional Divider function
 *
 *    @param[in]    uart    The pointer of the specified UART module.
 *
 *    @return       None
 *
 *    @details      This function use to disable Baud Rate fractional divider function.
 */
void UART_DisableBaudRateFrationalDivider(UART_T *uart)
{
    /* Disanble Baud Rate fractional divider fuction */
    /* Clear the Baud Rate fractional divider value   */
    uart->BAUD &= ~(UART_BAUD_BRFDEN_Msk | UART_BAUD_BRFD_Msk);
}


/** @} end of group UART_EXPORTED_FUNCTIONS */

/** @} end of group UART_Driver */

/** @} end of group Standard_Driver */
